src/org-files/guia-virtualizacion/virtualbox.org
#+TITLE:     Guia Virtualización - Virtualbox
#+SETUPFILE: ../theme-readtheorg.setup
#+EXPORT_FILE_NAME: ../../views/guia-virtualizacion/virtualbox.html

* 1. Instalacion de Virtualbox
  Nos aseguramos de instalar una version que se adapte a nuestro kernel

  #+NAME: instalar-virtualbox
  #+BEGIN_SRC shell
    # La version que nos diga sera la que agregamos
    mhwd-kernel -li
    # Instalamos virtualbox (suponiendo que tu kernel es linux54)
    sudo pacman -Syu virtualbox linux54-virtualbox-host-modules
    # Cargamos virtualbox
    sudo vboxreload
    # Instalamos la version extendida que agrega nuevas funcionalidades
    pacmac build virtualbox-ext-oracle
    # Agregamos el usuario actual al grupo de usuarios vbox
    sudo gpasswd -a $USER vboxusers
  #+END_SRC
* 2. Integrar Vagrant
** Instalación
  Tenemos otro apartado donde se explica con más detalle sobre *Vagrant* 
  en esta sección mencionaremos lo básico.

  #+NAME: virtualbox-vagrant-instalar
  #+BEGIN_SRC sh
    # Instalamos vagrant
    pacman -S vagrant

    # Instalamos plugins 
    # vagrant plugin install vagrant-vbguest vagrant-share
    # creamos directorio donde instalar sl ervidor
    mkdir manu-server && cd manu-server
    
    # Inicializamos con una distribucion centos 7 como servidor linux
    # vagrant box add centos-7.0-x86_64.box --name centos7
     
    # vagrant init centos/7
    vagrant init ubuntu/trusty64

    # Descargamos e instalamos el servidor linux 
    vagrant up 
    # Nos conectamos al servidor
    vagrant ssh
  #+END_SRC
** Comandos básicos
   #+NAME: vagrant-comandos
   |-------------------+--------------------------------------------|
   | Comando           | Descripcion                                |
   |-------------------+--------------------------------------------|
   | vagrant provision | Instalar paquetes agregados en Vagrantfile |
   | vagrant halt      |                                            |
   | vagrant up        | Descargar e instalar un box                |
   | vagrant ssh       | Conectarse al servidor                     |
   | vagrant init      | Inicializar                                |
   |-------------------+--------------------------------------------|
** Referencias
*** Referencias Web Oficiales
    - https://wiki.archlinux.org/index.php/Vagrant
    - https://www.vagrantup.com/docs/boxes/base.html
    - https://www.vagrantup.com/intro/getting-started/provisioning.html
*** Referencias Web Extraoficiales
    - https://dev.to/psnebc/vagrant-package-and-vagrant-box-add-8of
    - https://medium.com/@Joachim8675309/vagrant-provisioning-e4c9fd57968d
    - https://scotch.io/courses/getting-started-with-vagrant-for-local-development/provisioning-vmprovision-how-to-customize-the-box
    - https://blog.ipswitch.com/installing-your-first-vagrant-box
    - https://computingforgeeks.com/how-to-addinstall-and-run-centos-7-vagrant-box-to-virtualbox-using-vagrant/
* Referencias
** Referencias Web Oficiales
   - https://wiki.manjaro.org/index.php?title=VirtualBox
** Referencias Web Extraoficiales
   - https://www.2daygeek.com/how-to-resize-active-primary-root-partition-in-linux-using-gparted-utility/
   - https://access.redhat.com/articles/1190213
   - https://kwilson.io/blog/format-a-linux-disk-as-ext4-from-the-command-line/
   - https://www.tecmint.com/create-new-ext4-file-system-partition-in-linux/
   - https://www.profesionalreview.com/2018/11/19/virtualbox-extension-pack/
   - https://www.hostinger.com.ar/tutoriales/centos-vs-ubuntu-elegir-servidor-web/
   - https://webtematica.com/centos-o-debian-para-servidores-web
   - https://www.sinologic.net/2011-02/porque-debian-no-centos.html
