src/views/guia-virtualizacion/virtualbox.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-04-04 dom 00:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Guia Virtualización - Virtualbox</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="jelou" />
<link rel="stylesheet" type="text/css" href="/assets/css/style.css"/>
<link rel="stylesheet" type="text/css" href="/assets/css/sass-style.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Guia Virtualización - Virtualbox</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgabfb432">1. 1. Instalacion de Virtualbox</a></li>
<li><a href="#orgfe4383c">2. 2. Integrar Vagrant</a>
<ul>
<li><a href="#orgf186246">2.1. Instalación</a></li>
<li><a href="#orgbf17f07">2.2. Comandos básicos</a></li>
<li><a href="#org6a4997b">2.3. Referencias</a>
<ul>
<li><a href="#org25e8063">2.3.1. Referencias Web Oficiales</a></li>
<li><a href="#org63e4023">2.3.2. Referencias Web Extraoficiales</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org47215ab">3. Referencias</a>
<ul>
<li><a href="#org85be520">3.1. Referencias Web Oficiales</a></li>
<li><a href="#orgcd934d7">3.2. Referencias Web Extraoficiales</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgabfb432" class="outline-2">
<h2 id="orgabfb432"><span class="section-number-2">1</span> 1. Instalacion de Virtualbox</h2>
<div class="outline-text-2" id="text-1">
<p>
Nos aseguramos de instalar una version que se adapte a nuestro kernel
</p>

<div class="org-src-container">
<pre class="src src-shell" id="org641c1aa"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">La version que nos diga sera la que agregamos</span>
mhwd-kernel -li
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Instalamos virtualbox (suponiendo que tu kernel es linux54)</span>
sudo pacman -Syu virtualbox linux54-virtualbox-host-modules
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Cargamos virtualbox</span>
sudo vboxreload
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Instalamos la version extendida que agrega nuevas funcionalidades</span>
pacmac build virtualbox-ext-oracle
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Agregamos el usuario actual al grupo de usuarios vbox</span>
sudo gpasswd -a $<span style="color: #7590db;">USER</span> vboxusers
</pre>
</div>
</div>
</div>
<div id="outline-container-orgfe4383c" class="outline-2">
<h2 id="orgfe4383c"><span class="section-number-2">2</span> 2. Integrar Vagrant</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgf186246" class="outline-3">
<h3 id="orgf186246"><span class="section-number-3">2.1</span> Instalación</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Tenemos otro apartado donde se explica con más detalle sobre <b>Vagrant</b> 
en esta sección mencionaremos lo básico.
</p>

<div class="org-src-container">
<pre class="src src-sh" id="org722859e"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Instalamos vagrant</span>
pacman -S vagrant

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Instalamos plugins </span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">vagrant plugin install vagrant-vbguest vagrant-share</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">creamos directorio donde instalar sl ervidor</span>
mkdir manu-server &amp;&amp; <span style="color: #4f97d7;">cd</span> manu-server

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Inicializamos con una distribucion centos 7 como servidor linux</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">vagrant box add centos-7.0-x86_64.box --name centos7</span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">vagrant init centos/7</span>
vagrant init ubuntu/trusty64

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Descargamos e instalamos el servidor linux </span>
vagrant up 
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Nos conectamos al servidor</span>
vagrant ssh
</pre>
</div>
</div>
</div>
<div id="outline-container-orgbf17f07" class="outline-3">
<h3 id="orgbf17f07"><span class="section-number-3">2.2</span> Comandos básicos</h3>
<div class="outline-text-3" id="text-2-2">
<table id="orgee90646" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Comando</th>
<th scope="col" class="org-left">Descripcion</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">vagrant provision</td>
<td class="org-left">Instalar paquetes agregados en Vagrantfile</td>
</tr>

<tr>
<td class="org-left">vagrant halt</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">vagrant up</td>
<td class="org-left">Descargar e instalar un box</td>
</tr>

<tr>
<td class="org-left">vagrant ssh</td>
<td class="org-left">Conectarse al servidor</td>
</tr>

<tr>
<td class="org-left">vagrant init</td>
<td class="org-left">Inicializar</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org6a4997b" class="outline-3">
<h3 id="org6a4997b"><span class="section-number-3">2.3</span> Referencias</h3>
<div class="outline-text-3" id="text-2-3">
</div>
<div id="outline-container-org25e8063" class="outline-4">
<h4 id="org25e8063"><span class="section-number-4">2.3.1</span> Referencias Web Oficiales</h4>
<div class="outline-text-4" id="text-2-3-1">
<ul class="org-ul">
<li><a href="https://wiki.archlinux.org/index.php/Vagrant">https://wiki.archlinux.org/index.php/Vagrant</a></li>
<li><a href="https://www.vagrantup.com/docs/boxes/base.html">https://www.vagrantup.com/docs/boxes/base.html</a></li>
<li><a href="https://www.vagrantup.com/intro/getting-started/provisioning.html">https://www.vagrantup.com/intro/getting-started/provisioning.html</a></li>
</ul>
</div>
</div>
<div id="outline-container-org63e4023" class="outline-4">
<h4 id="org63e4023"><span class="section-number-4">2.3.2</span> Referencias Web Extraoficiales</h4>
<div class="outline-text-4" id="text-2-3-2">
<ul class="org-ul">
<li><a href="https://dev.to/psnebc/vagrant-package-and-vagrant-box-add-8of">https://dev.to/psnebc/vagrant-package-and-vagrant-box-add-8of</a></li>
<li><a href="https://medium.com/@Joachim8675309/vagrant-provisioning-e4c9fd57968d">https://medium.com/@Joachim8675309/vagrant-provisioning-e4c9fd57968d</a></li>
<li><a href="https://scotch.io/courses/getting-started-with-vagrant-for-local-development/provisioning-vmprovision-how-to-customize-the-box">https://scotch.io/courses/getting-started-with-vagrant-for-local-development/provisioning-vmprovision-how-to-customize-the-box</a></li>
<li><a href="https://blog.ipswitch.com/installing-your-first-vagrant-box">https://blog.ipswitch.com/installing-your-first-vagrant-box</a></li>
<li><a href="https://computingforgeeks.com/how-to-addinstall-and-run-centos-7-vagrant-box-to-virtualbox-using-vagrant/">https://computingforgeeks.com/how-to-addinstall-and-run-centos-7-vagrant-box-to-virtualbox-using-vagrant/</a></li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-org47215ab" class="outline-2">
<h2 id="org47215ab"><span class="section-number-2">3</span> Referencias</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org85be520" class="outline-3">
<h3 id="org85be520"><span class="section-number-3">3.1</span> Referencias Web Oficiales</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li><a href="https://wiki.manjaro.org/index.php?title=VirtualBox">https://wiki.manjaro.org/index.php?title=VirtualBox</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgcd934d7" class="outline-3">
<h3 id="orgcd934d7"><span class="section-number-3">3.2</span> Referencias Web Extraoficiales</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li><a href="https://www.2daygeek.com/how-to-resize-active-primary-root-partition-in-linux-using-gparted-utility/">https://www.2daygeek.com/how-to-resize-active-primary-root-partition-in-linux-using-gparted-utility/</a></li>
<li><a href="https://access.redhat.com/articles/1190213">https://access.redhat.com/articles/1190213</a></li>
<li><a href="https://kwilson.io/blog/format-a-linux-disk-as-ext4-from-the-command-line/">https://kwilson.io/blog/format-a-linux-disk-as-ext4-from-the-command-line/</a></li>
<li><a href="https://www.tecmint.com/create-new-ext4-file-system-partition-in-linux/">https://www.tecmint.com/create-new-ext4-file-system-partition-in-linux/</a></li>
<li><a href="https://www.profesionalreview.com/2018/11/19/virtualbox-extension-pack/">https://www.profesionalreview.com/2018/11/19/virtualbox-extension-pack/</a></li>
<li><a href="https://www.hostinger.com.ar/tutoriales/centos-vs-ubuntu-elegir-servidor-web/">https://www.hostinger.com.ar/tutoriales/centos-vs-ubuntu-elegir-servidor-web/</a></li>
<li><a href="https://webtematica.com/centos-o-debian-para-servidores-web">https://webtematica.com/centos-o-debian-para-servidores-web</a></li>
<li><a href="https://www.sinologic.net/2011-02/porque-debian-no-centos.html">https://www.sinologic.net/2011-02/porque-debian-no-centos.html</a></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: jelou</p>
<p class="date">Created: 2021-04-04 dom 00:14</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
